### Creating a Dataframe using List

In [132]:
import pandas as pd
import numpy as np

In [15]:
lst = ['harshit','sharma', 'nit', 'hamirpur']
pd.DataFrame(lst)

          0
0   harshit
1    sharma
2       nit
3  hamirpur

#### Creating a Dataframe Using Dictionary

In [18]:
data = {'Name':['Harshit', 'Tom', 'Krish'], 'Age':[21, 22, 26]}
pd.DataFrame(data)

      Name  Age
0  Harshit   21
1      Tom   22
2    Krish   26

In [20]:
data2 = {'Name'          :   ['tom' , 'chad' , 'sam'],
         'Age'           :   [23,24,25],
         'ID'            :   [1,2,3],
         'Qualification' :   ['bca', 'mba', 'bsc']}
df = pd.DataFrame(data2)
df

   Name  Age  ID Qualification
0   tom   23   1           bca
1  chad   24   2           mba
2   sam   25   3           bsc

In [22]:
df[['Name','Qualification']]

   Name Qualification
0   tom           bca
1  chad           mba
2   sam           bsc

### Slicing in Dataframe Using Iloc and LOC

In [25]:
data = {'one'    : pd.Series([1,2,3,4]),
        'two'    : pd.Series([10,20,30,40]),
        'three'  : pd.Series([100,200,300,400]),
        'four'   : pd.Series([1000,2000,3000,400])}
df = pd.DataFrame(data)
df.loc[:]

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400

In [27]:
df.loc[1:2, 'two':'three']

   two  three
1   20    200
2   30    300

In [29]:
df.iloc[ 0:4 , 0:4 ]

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400

Selecting specific rows

In [32]:
df.iloc[[0,2],[1,3]]

   two  four
0   10  1000
2   30  3000

### Slicing using Conditions

In [35]:
df.loc[df['two']>20,['three']]

   three
2    300
3    400

### Add new column

In [38]:
l = [22,23,34,35]
df['files']= l
df

   one  two  three  four  files
0    1   10    100  1000     22
1    2   20    200  2000     23
2    3   30    300  3000     34
3    4   40    400   400     35

In [40]:
df['one*two']= df['one']*df['two']

In [42]:
df

   one  two  three  four  files  one*two
0    1   10    100  1000     22       10
1    2   20    200  2000     23       40
2    3   30    300  3000     34       90
3    4   40    400   400     35      160

### deleting a column

In [45]:
del df['files']
df

   one  two  three  four  one*two
0    1   10    100  1000       10
1    2   20    200  2000       40
2    3   30    300  3000       90
3    4   40    400   400      160

In [47]:
df.pop('one*two')
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400

### Drop Fuction

In [56]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400

In [58]:
df.drop(['one','three'],axis =1)

   two  four
0   10  1000
1   20  2000
2   30  3000
3   40   400

In [60]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400

In [62]:
df.drop(['one'],axis =1)

   two  three  four
0   10    100  1000
1   20    200  2000
2   30    300  3000
3   40    400   400

In [66]:
df.drop([0,1], axis =0)

   one  two  three  four
2    3   30    300  3000
3    4   40    400   400

### Transpose

In [69]:
df.T

          0     1     2    3
one       1     2     3    4
two      10    20    30   40
three   100   200   300  400
four   1000  2000  3000  400

In [71]:
df

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000
3    4   40    400   400

### More DataFrame Fuctionaliteis

In [75]:
df.axes

[RangeIndex(start=0, stop=4, step=1),
 Index(['one', 'two', 'three', 'four'], dtype='object')]

In [77]:
df.ndim

2

In [79]:
df.dtypes

one      int64
two      int64
three    int64
four     int64
dtype: object

In [81]:
df.shape

(4, 4)

In [87]:
df.head(3)

   one  two  three  four
0    1   10    100  1000
1    2   20    200  2000
2    3   30    300  3000

In [91]:
df.tail(2)

   one  two  three  four
2    3   30    300  3000
3    4   40    400   400

In [93]:
df.empty

False

In [95]:
dd = pd.DataFrame()

In [97]:
dd.empty

True

### Statistical or Mathematical Function

In [102]:
df.sum()

one        10
two       100
three    1000
four     6400
dtype: int64

df.mean()

In [106]:
df.median()

one         2.5
two        25.0
three     250.0
four     1500.0
dtype: float64

In [108]:
df.std()

one         1.290994
two        12.909944
three     129.099445
four     1143.095213
dtype: float64

In [110]:
df.describe()

            one        two       three         four
count  4.000000   4.000000    4.000000     4.000000
mean   2.500000  25.000000  250.000000  1600.000000
std    1.290994  12.909944  129.099445  1143.095213
min    1.000000  10.000000  100.000000   400.000000
25%    1.750000  17.500000  175.000000   850.000000
50%    2.500000  25.000000  250.000000  1500.000000
75%    3.250000  32.500000  325.000000  2250.000000
max    4.000000  40.000000  400.000000  3000.000000

### Pipe Funtion

In [117]:
def add_(i,j):
    return i+j
def sub_(i,j):
    return i-j

In [119]:
df.pipe(add_,10)

   one  two  three  four
0   11   20    110  1010
1   12   30    210  2010
2   13   40    310  3010
3   14   50    410   410

In [121]:
df.pipe(sub_,10)

   one  two  three  four
0   -9    0     90   990
1   -8   10    190  1990
2   -7   20    290  2990
3   -6   30    390   390

In [127]:
def mean_(col):
    return col.mean()

def square_(i):
    return i**2

print(df.pipe(mean_))
df.pipe(mean_).pipe(square_)

one         2.5
two        25.0
three     250.0
four     1600.0
dtype: float64

one            6.25
two          625.00
three      62500.00
four     2560000.00
dtype: float64

### Apply Function

In [134]:
df.apply(np.mean)

one         2.5
two        25.0
three     250.0
four     1600.0
dtype: float64

In [136]:
df.apply(lambda x:x.max()-x.min())

one         3
two        30
three     300
four     2600
dtype: int64

### Apply Map

In [141]:
df.map(lambda x: x*100)

   one   two  three    four
0  100  1000  10000  100000
1  200  2000  20000  200000
2  300  3000  30000  300000
3  400  4000  40000   40000